Revit 2026 API

# LevelAssociationData Properties

---

The LevelAssociationData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

LevelAssociationData Class

Autodesk.Revit.DB Namespace